
# State **`s3://infrahouse-website-infra/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |        5 |           2 |            3 |
## Affected resources by action

|  Action  | Resources                                                                 |
|:--------:|:--------------------------------------------------------------------------|
|    🟢    | `module.website.aws_route53_record.cert_validation["www.infrahouse.com"]` |
|    🟢    | `module.website.aws_route53_record.extra[1]`                              |
|    🟡    | `module.website.aws_alb_listener_rule.website`                            |
|    🟡    | `module.website.aws_lb_listener.ssl`                                      |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.website.aws_acm_certificate.website must be replaced
+/- resource "aws_acm_certificate" "website" {
      ~ arn                       = "arn:aws:acm:us-west-1:493370826424:certificate/771f1304-0282-41e5-b88e-7d4413d37428" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "infrahouse.com"
              - resource_record_name  = "_7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_16f6deabd52e76d4ef61e80ec436b5df.shzbfwcggp.acm-validations.aws."
            },
          + {
              + domain_name           = "infrahouse.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "www.infrahouse.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-west-1:493370826424:certificate/771f1304-0282-41e5-b88e-7d4413d37428" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2025-11-24T23:59:59Z" -> (known after apply)
      ~ not_before                = "2024-10-25T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [
          - {
              - renewal_status        = "SUCCESS"
              - updated_at            = "2024-10-25T00:35:42Z"
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "www.infrahouse.com",
            # (1 unchanged element hidden)
        ]
        tags                      = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/website-pod/aws"
            "environment"       = "production"
            "service"           = "website"
        }
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ options (known after apply)
      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.website.aws_acm_certificate_validation.website must be replaced
-/+ resource "aws_acm_certificate_validation" "website" {
      ~ certificate_arn         = "arn:aws:acm:us-west-1:493370826424:certificate/771f1304-0282-41e5-b88e-7d4413d37428" -> (known after apply) # forces replacement
      ~ id                      = "2023-11-25 21:20:23.244 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com",
        ] -> (known after apply) # forces replacement
    }

  # module.website.aws_alb_listener_rule.website will be updated in-place
  ~ resource "aws_alb_listener_rule" "website" {
        id           = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener-rule/app/web20240913214119018400000001/899a5c5d81f7169f/bbb1d36949612f14/fdea8f2dd54d6fcd"
        tags         = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/website-pod/aws"
            "environment"       = "production"
            "service"           = "website"
        }
        # (4 unchanged attributes hidden)

      - condition {
          - host_header {
              - values = [
                  - "infrahouse.com",
                ] -> null
            }
        }
      + condition {
          + host_header {
              + values = [
                  + "infrahouse.com",
                  + "www.infrahouse.com",
                ]
            }
        }

        # (1 unchanged block hidden)
    }

  # module.website.aws_lb_listener.ssl will be updated in-place
  ~ resource "aws_lb_listener" "ssl" {
      ~ certificate_arn   = "arn:aws:acm:us-west-1:493370826424:certificate/771f1304-0282-41e5-b88e-7d4413d37428" -> (known after apply)
        id                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20240913214119018400000001/899a5c5d81f7169f/bbb1d36949612f14"
        tags              = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/website-pod/aws"
            "environment"       = "production"
            "service"           = "website"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.website.aws_route53_record.cert_validation["infrahouse.com"] must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "_7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com" -> (known after apply)
      ~ id                               = "Z07662251LH3YRF2ERM3G__7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com" -> (known after apply) # forces replacement
      ~ records                          = [
          - "_16f6deabd52e76d4ef61e80ec436b5df.shzbfwcggp.acm-validations.aws.",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.website.aws_route53_record.cert_validation["www.infrahouse.com"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z07662251LH3YRF2ERM3G"
    }

  # module.website.aws_route53_record.extra[1] will be created
  + resource "aws_route53_record" "extra" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.infrahouse.com"
      + type            = "A"
      + zone_id         = "Z07662251LH3YRF2ERM3G"

      + alias {
          + evaluate_target_health = true
          + name                   = "web20240913214119018400000001-1197472196.us-west-1.elb.amazonaws.com"
          + zone_id                = "Z368ELLRRE2KJ0"
        }
    }

Plan: 5 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS90ZXJyYWZvcm0udGZzdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJhZGQiOiA1LCAiY2hhbmdlIjogMiwgImRlc3Ryb3kiOiAzfX0=
```
</details>